experimental/glm52_b300_fixed_seq/results/c2-four-frontier-megamoe-refresh-20260921/runs/c2-w4a16-megamoe-autotune-20260921-recovery8/1k1k/w4a16-megamoe/tp4_conc8/benchmark.log
+ run_server_client env PYTHONPATH=/data/home/ziangli/inferencex-glm52-megamoe-autotune-20260921-recovery8/sources/inferencex:/data/home/ziangli/inferencex-glm52-megamoe-autotune-20260921-recovery8/sources/sglang/python:/data/home/ziangli/inferencex-glm52-megamoe-autotune-20260921-recovery8/sources/flashinfer:/data/home/ziangli/inferencex-glm52-megamoe-autotune-20260921-recovery8/sources/inferencex python3 -m infx.bench_serving.benchmark_serving --model nvidia/GLM-5.2-NVFP4 --backend vllm --base-url http://0.0.0.0:30000 --dataset-name random --random-input-len 1024 --random-output-len 1024 --random-range-ratio 0.8 --num-prompts 80 --max-concurrency 8 --request-rate inf --ignore-eos --save-result --num-warmups 16 --percentile-metrics ttft,tpot,itl,e2el --result-dir /data/home/ziangli/inferencex-glm52-megamoe-autotune-20260921-recovery8/results/c2-w4a16-megamoe-autotune-20260921-recovery8/1k1k/w4a16-megamoe/tp4_conc8 --result-filename result.json --use-chat-template --tokenizer /data/home/ziangli/inferencex-glm52-b300/checkpoints/GLM-5.2-NVFP4
+ [[ -n /data/home/ziangli/inferencex-glm52-megamoe-autotune-20260921-recovery8/native-runtime/c2-w4a16-megamoe-autotune-20260921-recovery8/1k1k/w4a16-megamoe/tp4_conc8/server-watch.json ]]
+ PYTHONPATH=/data/home/ziangli/inferencex-glm52-megamoe-autotune-20260921-recovery8/sources/inferencex:/data/home/ziangli/inferencex-glm52-megamoe-autotune-20260921-recovery8/sources/sglang/python:/data/home/ziangli/inferencex-glm52-megamoe-autotune-20260921-recovery8/sources/flashinfer:/data/home/ziangli/inferencex-glm52-megamoe-autotune-20260921-recovery8/sources/inferencex
+ python3 -m infx.bench_serving.server_watch run --state /data/home/ziangli/inferencex-glm52-megamoe-autotune-20260921-recovery8/native-runtime/c2-w4a16-megamoe-autotune-20260921-recovery8/1k1k/w4a16-megamoe/tp4_conc8/server-watch.json -- env PYTHONPATH=/data/home/ziangli/inferencex-glm52-megamoe-autotune-20260921-recovery8/sources/inferencex:/data/home/ziangli/inferencex-glm52-megamoe-autotune-20260921-recovery8/sources/sglang/python:/data/home/ziangli/inferencex-glm52-megamoe-autotune-20260921-recovery8/sources/flashinfer:/data/home/ziangli/inferencex-glm52-megamoe-autotune-20260921-recovery8/sources/inferencex python3 -m infx.bench_serving.benchmark_serving --model nvidia/GLM-5.2-NVFP4 --backend vllm --base-url http://0.0.0.0:30000 --dataset-name random --random-input-len 1024 --random-output-len 1024 --random-range-ratio 0.8 --num-prompts 80 --max-concurrency 8 --request-rate inf --ignore-eos --save-result --num-warmups 16 --percentile-metrics ttft,tpot,itl,e2el --result-dir /data/home/ziangli/inferencex-glm52-megamoe-autotune-20260921-recovery8/results/c2-w4a16-megamoe-autotune-20260921-recovery8/1k1k/w4a16-megamoe/tp4_conc8 --result-filename result.json --use-chat-template --tokenizer /data/home/ziangli/inferencex-glm52-b300/checkpoints/GLM-5.2-NVFP4
Namespace(backend='vllm', base_url='http://0.0.0.0:30000', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=8, model='nvidia/GLM-5.2-NVFP4', tokenizer='/data/home/ziangli/inferencex-glm52-b300/checkpoints/GLM-5.2-NVFP4', best_of=1, use_beam_search=False, num_prompts=80, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=False, metadata=None, result_dir='/data/home/ziangli/inferencex-glm52-megamoe-autotune-20260921-recovery8/results/c2-w4a16-megamoe-autotune-20260921-recovery8/1k1k/w4a16-megamoe/tp4_conc8', result_filename='result.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='90,99,99.9', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.8, random_prefix_len=0, use_chat_template=True, random_num_workers=0, dsv4=False, hf_subset=None, hf_split=None, hf_output_len=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, num_warmups=16)
Generating 80 prompts using 8 worker processes...
Prompt generation completed in 3.5s
-------------------  Input/Output Length Statistics  -------------------
 input_lens : min=822   max=1024  mean=924.21   avg_token_mismatch=12.00 
 output_lens: min=819   max=1024  mean=929.08  
------------------------------------------------------------------------ 

Starting initial single prompt test run...
Warming up with 16 requests...
100%|██████████| 16/16 [00:14<00:00,  1.11it/s]
Warmup completed.
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 8
  0%|          | 0/80 [00:00<?, ?it/s]Starting main benchmark run...
100%|██████████| 80/80 [01:26<00:00,  1.09s/it]
============ Serving Benchmark Result ============
Successful requests:                     80        
Benchmark duration (s):                  86.87     
Total input tokens:                      73937     
Total generated tokens:                  74326     
Request throughput (req/s):              0.92      
Output token throughput (tok/s):         855.57    
Total Token throughput (tok/s):          1706.65   
---------------Time to First Token----------------
Mean TTFT (ms):                          544.89    
Median TTFT (ms):                        278.74    
P90 TTFT (ms):                           1367.58   
P99 TTFT (ms):                           2109.39   
P99.9 TTFT (ms):                         2517.37   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          8.66      
Median TPOT (ms):                        8.70      
P90 TPOT (ms):                           9.75      
P99 TPOT (ms):                           10.67     
P99.9 TPOT (ms):                         10.80     
---------------Inter-token Latency----------------
Mean ITL (ms):                           724.61    
Median ITL (ms):                         508.38    
P90 ITL (ms):                            1505.42   
P99 ITL (ms):                            3185.21   
P99.9 ITL (ms):                          5574.33   
----------------End-to-end Latency----------------
Mean E2EL (ms):                          8578.96   
Median E2EL (ms):                        8601.01   
P90 E2EL (ms):                           9762.61   
P99 E2EL (ms):                           10728.28  
P99.9 E2EL (ms):                         11268.62  
==================================================
+ set +x